IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
<module name="TOP_CTRL_TOP_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_CTRL_PID" acronym="TOP_CTRL_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_DIEID0" acronym="TOP_CTRL_EFUSE_DIEID0" offset="0x10" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[31:0]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_DIEID1" acronym="TOP_CTRL_EFUSE_DIEID1" offset="0x14" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[63:32]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_DIEID2" acronym="TOP_CTRL_EFUSE_DIEID2" offset="0x18" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[95:64]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_DIEID3" acronym="TOP_CTRL_EFUSE_DIEID3" offset="0x1C" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE DieID[127:96]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_UID0" acronym="TOP_CTRL_EFUSE_UID0" offset="0x20" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE UID[31:0]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_UID1" acronym="TOP_CTRL_EFUSE_UID1" offset="0x24" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE UID[63:32]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_UID2" acronym="TOP_CTRL_EFUSE_UID2" offset="0x28" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE UID[95:64]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_UID3" acronym="TOP_CTRL_EFUSE_UID3" offset="0x2C" width="24" description="">
		<bitfield id="VAL" width="24" begin="23" end="0" resetval="0x0" description="EFUSE UID[120:96]" range="23 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_DEVICE_TYPE" acronym="TOP_CTRL_EFUSE_DEVICE_TYPE" offset="0x30" width="16" description="">
		<bitfield id="VAL" width="16" begin="15" end="0" resetval="0x0" description="EFUSE Device Type" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_FROM0_CHECKSUM" acronym="TOP_CTRL_EFUSE_FROM0_CHECKSUM" offset="0x34" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="32 bit FROM0 Checksum" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_JTAG_USERCODE_ID" acronym="TOP_CTRL_EFUSE_JTAG_USERCODE_ID" offset="0x38" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="EFUSE JTAG_USER_CODE_ID[31:0];. Denotes part variant" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE0_ROW_61" acronym="TOP_CTRL_EFUSE0_ROW_61" offset="0x400" width="32" description="">
		<bitfield id="EFUSE0_ROW_61" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE0_ROW_62" acronym="TOP_CTRL_EFUSE0_ROW_62" offset="0x404" width="32" description="">
		<bitfield id="EFUSE0_ROW_62" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE0_ROW_63" acronym="TOP_CTRL_EFUSE0_ROW_63" offset="0x408" width="32" description="">
		<bitfield id="EFUSE0_ROW_63" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_5" acronym="TOP_CTRL_EFUSE1_ROW_5" offset="0x40C" width="32" description="">
		<bitfield id="EFUSE1_ROW_5" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_6" acronym="TOP_CTRL_EFUSE1_ROW_6" offset="0x410" width="32" description="">
		<bitfield id="EFUSE1_ROW_6" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_7" acronym="TOP_CTRL_EFUSE1_ROW_7" offset="0x414" width="32" description="">
		<bitfield id="EFUSE1_ROW_7" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_8" acronym="TOP_CTRL_EFUSE1_ROW_8" offset="0x418" width="32" description="">
		<bitfield id="EFUSE1_ROW_8" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_9" acronym="TOP_CTRL_EFUSE1_ROW_9" offset="0x41C" width="32" description="">
		<bitfield id="EFUSE1_ROW_9" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_10" acronym="TOP_CTRL_EFUSE1_ROW_10" offset="0x420" width="32" description="">
		<bitfield id="EFUSE1_ROW_10" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_11" acronym="TOP_CTRL_EFUSE1_ROW_11" offset="0x424" width="32" description="">
		<bitfield id="EFUSE1_ROW_11" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_12" acronym="TOP_CTRL_EFUSE1_ROW_12" offset="0x428" width="32" description="">
		<bitfield id="CUSTOMER_IP_DISABLE" width="1" begin="25" end="25" resetval="0x0" description="Customer IP set control0 - All IPs enabled1 - Customer IP set disabled (PWM24-31,CMPSSA6-9,CMPSSB6-9 disabled)" range="25" rwaccess="RO"/> 
		<bitfield id="EPWM_FEATURE_DISABLE" width="1" begin="24" end="24" resetval="0x0" description="Customer protected features inside PWM IP 0 - All features enabled1 - Customer defined features are protected" range="24" rwaccess="RO"/> 
		<bitfield id="CANFD_DIS" width="4" begin="23" end="20" resetval="0x0" description="CANFD disables. Bit positions correspond to CAN instance. 0 - CAN is enabled1 - CAN is disabled" range="23 - 20" rwaccess="RO"/> 
		<bitfield id="ICSSM_HW_DIS" width="8" begin="19" end="12" resetval="0x0" description="See ICSSM Spec for features" range="19 - 12" rwaccess="RO"/> 
		<bitfield id="ICSSM_DIS" width="1" begin="11" end="11" resetval="0x0" description="ICSSM IP disable0 - ICSSM enabled1 - ICSSM disabled" range="11" rwaccess="RO"/> 
		<bitfield id="TWOX_CTRL_PERIP_DISABLE" width="1" begin="10" end="10" resetval="0x0" description="2x control IPs enabled0 - 1x control IPs (refer to PRD for the IP counts)1 - 2x control IPs (refer to PRD for the IP counts)" range="10" rwaccess="RO"/> 
		<bitfield id="R5SS_FREQ" width="1" begin="9" end="9" resetval="0x0" description="R5SS Freq0 - 400 MHz1 - 200 MHz" range="9" rwaccess="RO"/> 
		<bitfield id="R5SS1_DISABLE" width="1" begin="8" end="8" resetval="0x0" description="R5SS1 Disabled" range="8" rwaccess="RO"/> 
		<bitfield id="R5SS1_DUAL_CORE_DISABLE" width="1" begin="7" end="7" resetval="0x0" description="Force Lock step" range="7" rwaccess="RO"/> 
		<bitfield id="R5SS1_FORCE_DUAL_CORE" width="1" begin="6" end="6" resetval="0x0" description="Force Dual core" range="6" rwaccess="RO"/> 
		<bitfield id="R5SS0_DUAL_CORE_DISABLE" width="1" begin="5" end="5" resetval="0x0" description="Force Lock step" range="5" rwaccess="RO"/> 
		<bitfield id="R5SS0_FORCE_DUAL_CORE" width="1" begin="4" end="4" resetval="0x0" description="Force Dual core" range="4" rwaccess="RO"/> 
		<bitfield id="L2_MEM_SIZE" width="4" begin="3" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_13" acronym="TOP_CTRL_EFUSE1_ROW_13" offset="0x42C" width="8" description="">
		<bitfield id="ROM_PBIST_EN" width="1" begin="1" end="1" resetval="0x0" description="ROM PBIST ENABLE C ONTROL0 - PBIST DISABLE1 - PBIST ENABLE" range="1" rwaccess="RO"/> 
		<bitfield id="HSM_HALT_ON_ROM_ECC_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Enabling halting of the HSM operation on a ROM ECC error that is detected." range="0" rwaccess="RO"/>
	</register>
