IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE1_ROW_14" acronym="TOP_CTRL_EFUSE1_ROW_14" offset="0x430" width="32" description="">
		<bitfield id="EFUSE1_ROW_14" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_15" acronym="TOP_CTRL_EFUSE1_ROW_15" offset="0x434" width="32" description="">
		<bitfield id="EFUSE1_ROW_15" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_16" acronym="TOP_CTRL_EFUSE1_ROW_16" offset="0x438" width="32" description="">
		<bitfield id="EFUSE1_ROW_16" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_17" acronym="TOP_CTRL_EFUSE1_ROW_17" offset="0x43C" width="32" description="">
		<bitfield id="EFUSE1_ROW_17" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_18" acronym="TOP_CTRL_EFUSE1_ROW_18" offset="0x440" width="32" description="">
		<bitfield id="EFUSE1_ROW_18" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_19" acronym="TOP_CTRL_EFUSE1_ROW_19" offset="0x444" width="32" description="">
		<bitfield id="EFUSE1_ROW_19" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_20" acronym="TOP_CTRL_EFUSE1_ROW_20" offset="0x448" width="32" description="">
		<bitfield id="EFUSE1_ROW_20" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_21" acronym="TOP_CTRL_EFUSE1_ROW_21" offset="0x44C" width="32" description="">
		<bitfield id="EFUSE1_ROW_21" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_22" acronym="TOP_CTRL_EFUSE1_ROW_22" offset="0x450" width="32" description="">
		<bitfield id="EFUSE1_ROW_22" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_23" acronym="TOP_CTRL_EFUSE1_ROW_23" offset="0x454" width="32" description="">
		<bitfield id="EFUSE1_ROW_23" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_24" acronym="TOP_CTRL_EFUSE1_ROW_24" offset="0x458" width="32" description="">
		<bitfield id="EFUSE1_ROW_24" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_25" acronym="TOP_CTRL_EFUSE1_ROW_25" offset="0x45C" width="32" description="">
		<bitfield id="EFUSE1_ROW_25" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_26" acronym="TOP_CTRL_EFUSE1_ROW_26" offset="0x460" width="32" description="">
		<bitfield id="EFUSE1_ROW_26" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_27" acronym="TOP_CTRL_EFUSE1_ROW_27" offset="0x464" width="32" description="">
		<bitfield id="EFUSE1_ROW_27" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_28" acronym="TOP_CTRL_EFUSE1_ROW_28" offset="0x468" width="32" description="">
		<bitfield id="EFUSE1_ROW_28" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_29" acronym="TOP_CTRL_EFUSE1_ROW_29" offset="0x46C" width="32" description="">
		<bitfield id="EFUSE1_ROW_29" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_30" acronym="TOP_CTRL_EFUSE1_ROW_30" offset="0x470" width="32" description="">
		<bitfield id="EFUSE1_ROW_30" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_31" acronym="TOP_CTRL_EFUSE1_ROW_31" offset="0x474" width="32" description="">
		<bitfield id="EFUSE1_ROW_31" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_32" acronym="TOP_CTRL_EFUSE1_ROW_32" offset="0x478" width="32" description="">
		<bitfield id="EFUSE1_ROW_32" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
