IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE1_ROW_33" acronym="TOP_CTRL_EFUSE1_ROW_33" offset="0x47C" width="32" description="">
		<bitfield id="EFUSE1_ROW_33" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_34" acronym="TOP_CTRL_EFUSE1_ROW_34" offset="0x480" width="32" description="">
		<bitfield id="EFUSE1_ROW_34" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_35" acronym="TOP_CTRL_EFUSE1_ROW_35" offset="0x484" width="32" description="">
		<bitfield id="EFUSE1_ROW_35" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_36" acronym="TOP_CTRL_EFUSE1_ROW_36" offset="0x488" width="32" description="">
		<bitfield id="EFUSE1_ROW_36" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_37" acronym="TOP_CTRL_EFUSE1_ROW_37" offset="0x48C" width="32" description="">
		<bitfield id="EFUSE1_ROW_37" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_38" acronym="TOP_CTRL_EFUSE1_ROW_38" offset="0x490" width="32" description="">
		<bitfield id="EFUSE1_ROW_38" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_39" acronym="TOP_CTRL_EFUSE1_ROW_39" offset="0x494" width="32" description="">
		<bitfield id="EFUSE1_ROW_39" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_40" acronym="TOP_CTRL_EFUSE1_ROW_40" offset="0x498" width="32" description="">
		<bitfield id="EFUSE1_ROW_40" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_41" acronym="TOP_CTRL_EFUSE1_ROW_41" offset="0x49C" width="32" description="">
		<bitfield id="EFUSE1_ROW_41" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_42" acronym="TOP_CTRL_EFUSE1_ROW_42" offset="0x4A0" width="32" description="">
		<bitfield id="EFUSE1_ROW_42" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_43" acronym="TOP_CTRL_EFUSE1_ROW_43" offset="0x4A4" width="32" description="">
		<bitfield id="EFUSE1_ROW_43" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_44" acronym="TOP_CTRL_EFUSE1_ROW_44" offset="0x4A8" width="32" description="">
		<bitfield id="EFUSE1_ROW_44" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_45" acronym="TOP_CTRL_EFUSE1_ROW_45" offset="0x4AC" width="32" description="">
		<bitfield id="EFUSE1_ROW_45" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_46" acronym="TOP_CTRL_EFUSE1_ROW_46" offset="0x4B0" width="32" description="">
		<bitfield id="EFUSE1_ROW_46" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_47" acronym="TOP_CTRL_EFUSE1_ROW_47" offset="0x4B4" width="32" description="">
		<bitfield id="EFUSE1_ROW_47" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_48" acronym="TOP_CTRL_EFUSE1_ROW_48" offset="0x4B8" width="32" description="">
		<bitfield id="EFUSE1_ROW_48" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_49" acronym="TOP_CTRL_EFUSE1_ROW_49" offset="0x4BC" width="32" description="">
		<bitfield id="EFUSE1_ROW_49" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_50" acronym="TOP_CTRL_EFUSE1_ROW_50" offset="0x4C0" width="32" description="">
		<bitfield id="EFUSE1_ROW_50" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_51" acronym="TOP_CTRL_EFUSE1_ROW_51" offset="0x4C4" width="32" description="">
		<bitfield id="EFUSE1_ROW_51" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_52" acronym="TOP_CTRL_EFUSE1_ROW_52" offset="0x4C8" width="32" description="">
		<bitfield id="EFUSE1_ROW_52" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
