IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE1_ROW_53" acronym="TOP_CTRL_EFUSE1_ROW_53" offset="0x4CC" width="32" description="">
		<bitfield id="EFUSE1_ROW_53" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_54" acronym="TOP_CTRL_EFUSE1_ROW_54" offset="0x4D0" width="32" description="">
		<bitfield id="EFUSE1_ROW_54" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_55" acronym="TOP_CTRL_EFUSE1_ROW_55" offset="0x4D4" width="32" description="">
		<bitfield id="EFUSE1_ROW_55" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE1_ROW_56" acronym="TOP_CTRL_EFUSE1_ROW_56" offset="0x4D8" width="32" description="">
		<bitfield id="EFUSE1_ROW_56" width="26" begin="25" end="0" resetval="0x0" description="Captures the EFUSE Value. Refer to EFUSE Mapping XLS for more details" range="25 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_MAC_ID0" acronym="TOP_CTRL_MAC_ID0" offset="0x500" width="32" description="">
		<bitfield id="MACID_LO" width="32" begin="31" end="0" resetval="0x0" description="MAC ID low [32bits]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_MAC_ID1" acronym="TOP_CTRL_MAC_ID1" offset="0x504" width="16" description="">
		<bitfield id="MACID_HI" width="16" begin="15" end="0" resetval="0x0" description="MAC ID high [16bits]" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMP_M40C" acronym="TOP_CTRL_TRIM_TEMP_M40C" offset="0x510" width="16" description="">
		<bitfield id="TEMP" width="11" begin="10" end="0" resetval="0x0" description="Record the temperature at which the temp sensor trims were performed" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMPSENSE_M40C0" acronym="TOP_CTRL_TRIM_TEMPSENSE_M40C0" offset="0x514" width="32" description="">
		<bitfield id="TRIM" width="32" begin="31" end="0" resetval="0x0" description="Trim for temperature sensor calibration [Lower 32bits]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMPSENSE_M40C1" acronym="TOP_CTRL_TRIM_TEMPSENSE_M40C1" offset="0x518" width="8" description="">
		<bitfield id="TRIM" width="9" begin="8" end="0" resetval="0x0" description="Trim for temperature sensor calibration [Upper 9bits]" range="8 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMP_150C" acronym="TOP_CTRL_TRIM_TEMP_150C" offset="0x51C" width="16" description="">
		<bitfield id="TEMP" width="11" begin="10" end="0" resetval="0x0" description="Record the temperature at which the temp sensor trims were performed" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMPSENSE_150C0" acronym="TOP_CTRL_TRIM_TEMPSENSE_150C0" offset="0x520" width="32" description="">
		<bitfield id="TRIM" width="32" begin="31" end="0" resetval="0x0" description="Trim for temperature sensor calibration [Lower 32bits]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMPSENSE_150C1" acronym="TOP_CTRL_TRIM_TEMPSENSE_150C1" offset="0x524" width="8" description="">
		<bitfield id="TRIM" width="9" begin="8" end="0" resetval="0x0" description="Trim for temperature sensor calibration [Upper 9bits]" range="8 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMP_30C" acronym="TOP_CTRL_TRIM_TEMP_30C" offset="0x528" width="16" description="">
		<bitfield id="TEMP" width="11" begin="10" end="0" resetval="0x0" description="Record the temperature at which the temp sensor trims were performed" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMPSENSE_30C0" acronym="TOP_CTRL_TRIM_TEMPSENSE_30C0" offset="0x52C" width="32" description="">
		<bitfield id="TRIM" width="32" begin="31" end="0" resetval="0x0" description="Trim for temperature sensor calibration [Lower 32bits]" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TRIM_TEMPSENSE_30C1" acronym="TOP_CTRL_TRIM_TEMPSENSE_30C1" offset="0x530" width="8" description="">
		<bitfield id="TRIM" width="9" begin="8" end="0" resetval="0x0" description="Trim for temperature sensor calibration [Upper 9bits]" range="8 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_N_FACTOR_TEMPSENSE" acronym="TOP_CTRL_N_FACTOR_TEMPSENSE" offset="0x534" width="16" description="">
		<bitfield id="VAL" width="14" begin="13" end="0" resetval="0x0" description="Temp Sensor N factor" range="13 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSHUT_HOT" acronym="TOP_CTRL_TSHUT_HOT" offset="0x538" width="8" description="">
		<bitfield id="VAL" width="8" begin="7" end="0" resetval="0x0" description="Default efuse defined hot temperature shutdown. Can be overriden by writing to TSENSE0_TSHUT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSHUT_COLD" acronym="TOP_CTRL_TSHUT_COLD" offset="0x53C" width="8" description="">
		<bitfield id="VAL" width="8" begin="7" end="0" resetval="0x0" description="Default efuse defined cold temperature shutdown. Can be overriden by writing to TSENSE0_TSHUT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_HSM_HALT_ON_ROM_ECC_ERR_EN" acronym="TOP_CTRL_EFUSE_OVERRIDE_HSM_HALT_ON_ROM_ECC_ERR_EN" offset="0x800" width="8" description="">
		<bitfield id="OVERRIDE_VAL" width="1" begin="4" end="4" resetval="0x0" description="Override MMR value" range="4" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
