IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE_OVERRIDE_MEM_MARGINCTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_MEM_MARGINCTRL" offset="0x804" width="32" description="">
		<bitfield id="BRG_MARGIN" width="2" begin="29" end="28" resetval="0x0" description="Override MMR value" range="29 - 28" rwaccess="RW"/> 
		<bitfield id="BRG_MARGIN_OVERRIDE" width="3" begin="26" end="24" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="BYG_MARGIN" width="2" begin="21" end="20" resetval="0x0" description="Override MMR value" range="21 - 20" rwaccess="RW"/> 
		<bitfield id="BYG_MARGIN_OVERRIDE" width="3" begin="18" end="16" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="GWG_MARGIN" width="4" begin="15" end="12" resetval="0x0" description="Override MMR value" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="GWG_MARGIN_OVERRIDE" width="3" begin="10" end="8" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="GLG_MARGIN" width="2" begin="5" end="4" resetval="0x0" description="Override MMR value" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="GLG_MARGIN_OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC0_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC0_TRIM" offset="0x808" width="32" description="">
		<bitfield id="ADC0_TRIM" width="15" begin="30" end="16" resetval="0x0" description="offset trim of the ADC (3 values each 5 bit for SE-p, SE-m &#38; Diff)" range="30 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW Value Write 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC1_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC1_TRIM" offset="0x80C" width="32" description="">
		<bitfield id="ADC1_TRIM" width="15" begin="30" end="16" resetval="0x0" description="offset trim of the ADC (3 values each 5 bit for SE-p, SE-m &#38; Diff)" range="30 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC2_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC2_TRIM" offset="0x810" width="32" description="">
		<bitfield id="ADC2_TRIM" width="15" begin="30" end="16" resetval="0x0" description="offset trim of the ADC (3 values each 5 bit for SE-p, SE-m &#38; Diff)" range="30 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC3_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC3_TRIM" offset="0x814" width="32" description="">
		<bitfield id="ADC3_TRIM" width="15" begin="30" end="16" resetval="0x0" description="offset trim of the ADC (3 values each 5 bit for SE-p, SE-m &#38; Diff)" range="30 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC4_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC4_TRIM" offset="0x818" width="32" description="">
		<bitfield id="ADC4_TRIM" width="15" begin="30" end="16" resetval="0x0" description="offset trim of the ADC (3 values each 5 bit for SE-p, SE-m &#38; Diff)" range="30 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG_CTRL" offset="0x81C" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG0" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG0" offset="0x820" width="32" description="">
		<bitfield id="ADC_CFG_31_0" width="32" begin="31" end="0" resetval="0x1363498185" description="Family Trim. Will be same for all ADC's. Finalized during Bench/ATE char" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG1" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG1" offset="0x824" width="32" description="">
		<bitfield id="ADC_CFG_63_32" width="32" begin="31" end="0" resetval="0x3495560" description="Family Trim. Will be same for all ADC's. Finalized during Bench/ATE char" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG2" acronym="TOP_CTRL_EFUSE_OVERRIDE_ADC_CFG2" offset="0x828" width="24" description="">
		<bitfield id="ADC_CFG_87_64" width="24" begin="23" end="0" resetval="0x4194305" description="Family Trim. Will be same for all ADC's. Finalized during Bench/ATE char" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS01_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS01_TRIM_CTRL" offset="0x82C" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS01_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS01_TRIM" offset="0x830" width="32" description="">
		<bitfield id="CSS01_TRIM" width="32" begin="31" end="0" resetval="0x0" description="CSS Trim signal" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS23_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS23_TRIM_CTRL" offset="0x834" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
