IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS23_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS23_TRIM" offset="0x838" width="32" description="">
		<bitfield id="CSS23_TRIM" width="32" begin="31" end="0" resetval="0x0" description="CSS Trim signal" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS45_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS45_TRIM_CTRL" offset="0x83C" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS45_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS45_TRIM" offset="0x840" width="32" description="">
		<bitfield id="CSS45_TRIM" width="32" begin="31" end="0" resetval="0x0" description="CSS Trim signal" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS67_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS67_TRIM_CTRL" offset="0x844" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS67_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS67_TRIM" offset="0x848" width="32" description="">
		<bitfield id="CSS67_TRIM" width="32" begin="31" end="0" resetval="0x0" description="CSS Trim signal" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS89_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS89_TRIM_CTRL" offset="0x84C" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS89_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS89_TRIM" offset="0x850" width="32" description="">
		<bitfield id="CSS89_TRIM" width="32" begin="31" end="0" resetval="0x0" description="CSS Trim signal" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS_CFG_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS_CFG_CTRL" offset="0x854" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS_CFG0" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS_CFG0" offset="0x858" width="32" description="">
		<bitfield id="CSS_CFG_31_0" width="32" begin="31" end="0" resetval="0x0" description="Compdac Family trim (all CMPSS a &#38; b)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_CSS_CFG1" acronym="TOP_CTRL_EFUSE_OVERRIDE_CSS_CFG1" offset="0x85C" width="32" description="">
		<bitfield id="CSS_CFG_0_63_32" width="32" begin="31" end="0" resetval="0x0" description="Compdac Family trim (all CMPSS a &#38; b)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_DAC_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_DAC_TRIM" offset="0x860" width="32" description="">
		<bitfield id="DAC_TRIM" width="13" begin="28" end="16" resetval="0x0" description="DAC Trim28:24 : [12:8] gain trim; 23:16 :  [7:0] offset trim" range="28 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_DAC_CFG" acronym="TOP_CTRL_EFUSE_OVERRIDE_DAC_CFG" offset="0x864" width="24" description="">
		<bitfield id="ASYNC_MODE_EN" width="1" begin="24" end="24" resetval="0x0" description="async_mode_en" range="24" rwaccess="RW"/> 
		<bitfield id="IBIAS_CFG" width="2" begin="17" end="16" resetval="0x0" description="ibias_cfg[1:0]" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_REFBUF0_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_REFBUF0_TRIM" offset="0x868" width="32" description="">
		<bitfield id="ROK0B_UV_TRIM" width="4" begin="31" end="28" resetval="0x1" description="ROK0B Under voltage threshold trim" range="31 - 28" rwaccess="RW"/> 
		<bitfield id="ROK0B_OV_TRIM" width="4" begin="27" end="24" resetval="0x15" description="ROK0B Over voltage threshold trim" range="27 - 24" rwaccess="RW"/> 
		<bitfield id="ROK0A_UV_TRIM" width="4" begin="23" end="20" resetval="0x13" description="ROK0A Under voltage threshold trim" range="23 - 20" rwaccess="RW"/> 
		<bitfield id="ROK0A_OV_TRIM" width="4" begin="19" end="16" resetval="0x1" description="ROK0A Over voltage threshold trim" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="REF_TRIM" width="8" begin="15" end="8" resetval="0x0" description="Trims output voltage with 1mV steps, +/-30mV, default 0V" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_REFBUF0_CFG" acronym="TOP_CTRL_EFUSE_OVERRIDE_REFBUF0_CFG" offset="0x86C" width="32" description="">
		<bitfield id="ROK0B_VSEL" width="4" begin="27" end="24" resetval="0x13" description="Voltage selection for reference OK comp (1.46V to 1.86V) (ROK0B)" range="27 - 24" rwaccess="RW"/> 
		<bitfield id="ROK0A_VSEL" width="4" begin="23" end="20" resetval="0x0" description="Voltage selection for reference OK comp (1.46V to 1.86V)" range="23 - 20" rwaccess="RW"/> 
		<bitfield id="ADCREF_VSEL" width="4" begin="19" end="16" resetval="0x13" description="Selects output voltage level from 1.46V to 1.86V; default code is 1.8V" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="REFBUF0_CFG" width="7" begin="14" end="8" resetval="0x42" description="Bit0: Debug feature, doubles the current of the 2nd stage. enfbres_pwdBit6-1: adjust current bias for the 1st, 2nd and 3rd stages.trim_ampbias[5:0]" range="14 - 8" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_REFBUF1_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_REFBUF1_TRIM" offset="0x870" width="24" description="">
		<bitfield id="ROK1_UV_TRIM" width="4" begin="23" end="20" resetval="0x1" description="ROK0A Under voltage threshold trim" range="23 - 20" rwaccess="RW"/> 
		<bitfield id="ROK1_OV_TRIM" width="4" begin="19" end="16" resetval="0x15" description="ROK0A Over voltage threshold trim" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="REF_TRIM" width="8" begin="15" end="8" resetval="0x31" description="Trims output voltage with 1mV steps, +/-30mV, default 0V" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_REFBUF1_CFG" acronym="TOP_CTRL_EFUSE_OVERRIDE_REFBUF1_CFG" offset="0x874" width="24" description="">
		<bitfield id="ROK1_VSEL" width="4" begin="23" end="20" resetval="0x0" description="Voltage selection for reference OK comp (1.46V to 1.86V)" range="23 - 20" rwaccess="RW"/> 
		<bitfield id="ADCREF_VSEL" width="4" begin="19" end="16" resetval="0x13" description="Selects output voltage level from 1.46V to 1.86V; default code is 1.8V" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="REFBUF1_CFG" width="7" begin="14" end="8" resetval="0x42" description="Bit0: Debug feature, doubles the current of the 2nd stage. enfbres_pwdBit6-1: adjust current bias for the 1st, 2nd and 3rd stages.trim_ampbias[5:0]" range="14 - 8" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
