IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE_OVERRIDE_PMU_CFG" acronym="TOP_CTRL_EFUSE_OVERRIDE_PMU_CFG" offset="0x878" width="32" description="">
		<bitfield id="LDO_DFTC" width="7" begin="30" end="24" resetval="0x9" description="Main LDO(1.8v) Config signals.Bit15: Not UsedBit14: 1 Double current in clampBit13: 1 Local ~200uA load resistor connected to ldooutBit12: 1  Amplifier ok bypassedBit 11-10: Adjust master current mirror in amplifier   2'b11 = 0.67x current   2'b10 = 0.5x current   2'b01 = 2.0x current   2'b00 = 1.0x currentBit9: 1 Allows higher slewing current (should only assert after bootup)" range="30 - 24" rwaccess="RW"/> 
		<bitfield id="BG_DFTC" width="5" begin="20" end="16" resetval="0x0" description="Bandgap DFT controls for debug purposes.Bit7: 1 To short large BJT base resistor to GNDBit6: 1 To short small BJT base resistor to GNDBit5: 1 To turn OFF startup pull NMOSBit4: 1 To turn OFF startup currentBit3: 1  to adjust(increase) BGAMP biasing" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_PMU_SPARE_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_PMU_SPARE_TRIM" offset="0x87C" width="32" description="">
		<bitfield id="TRIM" width="10" begin="25" end="16" resetval="0x0" description="PMU spare trim override value{pmu_trim_1p1v&#60;7:6>,pmu_trim_1p1v&#60;19:18>,pmu_trim_1p1v&#60;35:30>}" range="25 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value for PMU SPARE trimWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_LDO_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_LDO_TRIM" offset="0x880" width="32" description="">
		<bitfield id="LDO_TRIM_OFFSET" width="6" begin="29" end="24" resetval="0x0" description="LDO Fine trim around program point" range="29 - 24" rwaccess="RW"/> 
		<bitfield id="LDO_PROG" width="4" begin="19" end="16" resetval="0x0" description="LDO programming controls. Adjusts nominal LDO output voltage" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_BG_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_BG_TRIM" offset="0x884" width="32" description="">
		<bitfield id="BG_TRIMC" width="6" begin="29" end="24" resetval="0x26" description="Bandgap curvture/slope trim bits" range="29 - 24" rwaccess="RW"/> 
		<bitfield id="BG_TRIMMAG" width="4" begin="19" end="16" resetval="0x8" description="Bandgap magnitude trim bits" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="BG_TRIMI" width="8" begin="15" end="8" resetval="0x40" description="[19:18] = Unused[17:12] = Bandgap current trim bits" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_SFTYMON_THRHLD_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_SFTYMON_THRHLD_TRIM_CTRL" offset="0x888" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_SFTYMON_THRHLD_TRIM0" acronym="TOP_CTRL_EFUSE_OVERRIDE_SFTYMON_THRHLD_TRIM0" offset="0x88C" width="32" description="">
		<bitfield id="C5_LOW_TRIM" width="4" begin="31" end="28" resetval="0x0" description="C5, low side threshold trim setting" range="31 - 28" rwaccess="RW"/> 
		<bitfield id="C5_HIGH_TRIM" width="4" begin="27" end="24" resetval="0x15" description="C5, high side threshold trim setting" range="27 - 24" rwaccess="RW"/> 
		<bitfield id="C3_LOW_TRIM" width="4" begin="23" end="20" resetval="0x0" description="C3, low side threshold trim setting" range="23 - 20" rwaccess="RW"/> 
		<bitfield id="C3_HIGH_TRIM" width="4" begin="19" end="16" resetval="0x15" description="C3, high side threshold trim setting" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="C2_LOW_TRIM" width="4" begin="15" end="12" resetval="0x0" description="C2, low side threshold trim setting" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="C2_HIGH_TRIM" width="4" begin="11" end="8" resetval="0x15" description="C2, high side threshold trim setting" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="C1_LOW_TRIM" width="4" begin="7" end="4" resetval="0x0" description="C1, low side threshold trim setting" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="C1_HIGH_TRIM" width="4" begin="3" end="0" resetval="0x15" description="C1, high side threshold trim setting;" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_SFTYMON_THRHLD_TRIM1" acronym="TOP_CTRL_EFUSE_OVERRIDE_SFTYMON_THRHLD_TRIM1" offset="0x890" width="8" description="">
		<bitfield id="C8_LOW_TRIM" width="4" begin="3" end="0" resetval="0x0" description="C8, low side threshold trim setting" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_RCOSC_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_RCOSC_TRIM" offset="0x894" width="24" description="">
		<bitfield id="FREQ_TRIM" width="7" begin="22" end="16" resetval="0x0" description="RC oscillator frequency trim" range="22 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SAFETYMON_SPARE" acronym="TOP_CTRL_EFUSE_SAFETYMON_SPARE" offset="0x898" width="24" description="">
		<bitfield id="VAL" width="8" begin="23" end="16" resetval="0x0" description="SAFETYMON_SPARE trim override value" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SPARE_1" acronym="TOP_CTRL_EFUSE_SPARE_1" offset="0x89C" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_1 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SPARE_2" acronym="TOP_CTRL_EFUSE_SPARE_2" offset="0x8A0" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_2 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
