IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_EFUSE_SPARE_3" acronym="TOP_CTRL_EFUSE_SPARE_3" offset="0x8A4" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_3 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SPARE_4" acronym="TOP_CTRL_EFUSE_SPARE_4" offset="0x8A8" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_4 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SPARE_5" acronym="TOP_CTRL_EFUSE_SPARE_5" offset="0x8AC" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_5 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SPARE_6" acronym="TOP_CTRL_EFUSE_SPARE_6" offset="0x8B0" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_6 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_SPARE_7" acronym="TOP_CTRL_EFUSE_SPARE_7" offset="0x8B4" width="24" description="">
		<bitfield id="VAL" width="5" begin="20" end="16" resetval="0x0" description="SPARE_6 trim override value" range="20 - 16" rwaccess="RW"/> 
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_TSENSE_TRIM_CTRL" acronym="TOP_CTRL_EFUSE_OVERRIDE_TSENSE_TRIM_CTRL" offset="0x8B8" width="8" description="">
		<bitfield id="OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Override EFUSE Value with SW ValueWrite 3'b000 : EFUSE ValueWrite 3'b111 : MMR Value" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_TSENSE_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_TSENSE_TRIM" offset="0x8BC" width="32" description="">
		<bitfield id="VPTAT_RTRIM" width="2" begin="31" end="30" resetval="0x3" description="TS: Vptat R trim (PTAT voltage resistor trim)" range="31 - 30" rwaccess="RW"/> 
		<bitfield id="TSHUT_TRIM" width="6" begin="29" end="24" resetval="0x16" description="Tshut Temperature C (Shutdown temperature trim)" range="29 - 24" rwaccess="RW"/> 
		<bitfield id="DTRTEMPS" width="8" begin="23" end="16" resetval="0x5" description="RDAC offset trim" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DTRBGAPV" width="8" begin="15" end="8" resetval="0x0" description="TS Bandgap magnitude trim" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DTRBGAPC" width="8" begin="7" end="0" resetval="0x0" description="TS Bandgap curvature trim" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_EFUSE_OVERRIDE_PLL_TRIM" acronym="TOP_CTRL_EFUSE_OVERRIDE_PLL_TRIM" offset="0x8C0" width="32" description="">
		<bitfield id="PER_NWELLTRIM_OVERRIDE_VAL" width="5" begin="28" end="24" resetval="0x9" description="Peripheral ADPLL trim override value when  per_adpll_trim_override is programmed" range="28 - 24" rwaccess="RW"/> 
		<bitfield id="PER_NWELLTRIM_OVERRIDE" width="3" begin="18" end="16" resetval="0x0" description="Peripheral ADPLL trim value is overridden by per_adpll_trim_override_val when this bit is programmed 1" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CORE_NWELLTRIM_OVERRIDE_VAL" width="5" begin="12" end="8" resetval="0x9" description="Core ADPLL trim override value when  core_adpll_trim_override is programmed" range="12 - 8" rwaccess="RW"/> 
		<bitfield id="CORE_NWELLTRIM_OVERRIDE" width="3" begin="2" end="0" resetval="0x0" description="Core ADPLL trim value is overridden by core_adpll_trim_override_val when this bit is programmed 1" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_ADC_REFBUF0_CTRL" acronym="TOP_CTRL_ADC_REFBUF0_CTRL" offset="0xC00" width="8" description="">
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x0" description="Enables adc reference 0, mask hhv before enable000: Disable111 : Enable" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_ADC_REFBUF1_CTRL" acronym="TOP_CTRL_ADC_REFBUF1_CTRL" offset="0xC04" width="8" description="">
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x0" description="Enables adc reference 0, mask hhv before enable000: Disable111 : Enable" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_ADC_REF_COMP_CTRL" acronym="TOP_CTRL_ADC_REF_COMP_CTRL" offset="0xC08" width="16" description="">
		<bitfield id="ADC34_REFOK_EN" width="3" begin="10" end="8" resetval="0x0" description="enables reference comparators (ROK1). This monitors adc3 &#38; adc4 refernc" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="ADC12_REFOK_EN" width="3" begin="6" end="4" resetval="0x0" description="enables reference comparators (ROK0B). This monitors adc1 &#38; adc2 refernce" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ADC0_REFOK_EN" width="3" begin="2" end="0" resetval="0x0" description="enables reference comparators (ROK0). This monitors adc0 refernce" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_ADC_REF_GOOD_STATUS" acronym="TOP_CTRL_ADC_REF_GOOD_STATUS" offset="0xC0C" width="8" description="">
		<bitfield id="ADC34_REF_UV_GOOD" width="1" begin="5" end="5" resetval="0x1" description="Under Voltage check OK" range="5" rwaccess="RO"/> 
		<bitfield id="ADC34_REF_OV_GOOD" width="1" begin="4" end="4" resetval="0x1" description="Over voltage check OK" range="4" rwaccess="RO"/> 
		<bitfield id="ADC12_REF_UV_GOOD" width="1" begin="3" end="3" resetval="0x1" description="Under Voltage check OK" range="3" rwaccess="RO"/> 
		<bitfield id="ADC12_REF_OV_GOOD" width="1" begin="2" end="2" resetval="0x1" description="Over voltage check OK" range="2" rwaccess="RO"/> 
		<bitfield id="ADC0_REF_UV_GOOD" width="1" begin="1" end="1" resetval="0x1" description="Under Voltage check OK" range="1" rwaccess="RO"/> 
		<bitfield id="ADC0_REF_OV_GOOD" width="1" begin="0" end="0" resetval="0x1" description="Over voltage check OK" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_VMON_CTRL" acronym="TOP_CTRL_VMON_CTRL" offset="0xC10" width="32" description="">
		<bitfield id="CMP8_EN" width="3" begin="26" end="24" resetval="0x7" description="VMON EN" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="CMP7_EN" width="3" begin="22" end="20" resetval="0x7" description="VMON EN" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="CMP5_EN" width="3" begin="18" end="16" resetval="0x7" description="VMON EN" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CMP3_EN" width="3" begin="14" end="12" resetval="0x7" description="VMON EN" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="CMP2_EN" width="3" begin="10" end="8" resetval="0x7" description="VMON EN" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="CMP1_EN" width="3" begin="6" end="4" resetval="0x7" description="VMON EN" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="CMP0_EN" width="3" begin="2" end="0" resetval="0x7" description="VMON EN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_VMON_STAT" acronym="TOP_CTRL_VMON_STAT" offset="0xC14" width="16" description="">
		<bitfield id="CMP8_UV_OK" width="1" begin="10" end="10" resetval="0x1" description="VMON OK" range="10" rwaccess="RO"/> 
		<bitfield id="CMP7_UV_OK" width="1" begin="9" end="9" resetval="0x1" description="VMON OK" range="9" rwaccess="RO"/> 
		<bitfield id="CMP5_UV_OK" width="1" begin="8" end="8" resetval="0x1" description="VMON OK" range="8" rwaccess="RO"/> 
		<bitfield id="CMP5_OV_OK" width="1" begin="7" end="7" resetval="0x1" description="VMON OK" range="7" rwaccess="RO"/> 
		<bitfield id="CMP3_UV_OK" width="1" begin="6" end="6" resetval="0x1" description="VMON OK" range="6" rwaccess="RO"/> 
		<bitfield id="CMP3_OV_OK" width="1" begin="5" end="5" resetval="0x1" description="VMON OK" range="5" rwaccess="RO"/> 
		<bitfield id="CMP2_UV_OK" width="1" begin="4" end="4" resetval="0x1" description="VMON OK" range="4" rwaccess="RO"/> 
		<bitfield id="CMP2_OV_OK" width="1" begin="3" end="3" resetval="0x1" description="VMON OK" range="3" rwaccess="RO"/> 
		<bitfield id="CMP1_UV_OK" width="1" begin="2" end="2" resetval="0x1" description="VMON OK" range="2" rwaccess="RO"/> 
		<bitfield id="CMP1_OV_OK" width="1" begin="1" end="1" resetval="0x1" description="VMON OK" range="1" rwaccess="RO"/> 
		<bitfield id="CMP0_UV_OK" width="1" begin="0" end="0" resetval="0x1" description="VMON OK" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_PMU_COARSE_STAT" acronym="TOP_CTRL_PMU_COARSE_STAT" offset="0xC18" width="8" description="">
		<bitfield id="VSUP18_RDY" width="1" begin="3" end="3" resetval="0x1" description="Coarse VMON OK" range="3" rwaccess="RO"/> 
		<bitfield id="VCORE_RDY" width="1" begin="2" end="2" resetval="0x1" description="Coarse VMON OK" range="2" rwaccess="RO"/> 
		<bitfield id="LDO_RDY" width="1" begin="1" end="1" resetval="0x1" description="Coarse VMON OK" range="1" rwaccess="RO"/> 
		<bitfield id="BG_RDY" width="1" begin="0" end="0" resetval="0x1" description="Coarse VMON OK" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_MASK_VMON_ERROR_ESM_H" acronym="TOP_CTRL_MASK_VMON_ERROR_ESM_H" offset="0xC20" width="16" description="">
		<bitfield id="ADC34_REF_UV_MASK" width="1" begin="16" end="16" resetval="0x1" description="VMON Error Mask to ESM" range="16" rwaccess="RW"/> 
		<bitfield id="ADC34_REF_OV_MASK" width="1" begin="15" end="15" resetval="0x1" description="VMON Error Mask to ESM" range="15" rwaccess="RW"/> 
		<bitfield id="ADC12_REF_UV_MASK" width="1" begin="14" end="14" resetval="0x1" description="VMON Error Mask to ESM" range="14" rwaccess="RW"/> 
		<bitfield id="ADC12_REF_OV_MASK" width="1" begin="13" end="13" resetval="0x1" description="VMON Error Mask to ESM" range="13" rwaccess="RW"/> 
		<bitfield id="ADC0_REF_UV_MASK" width="1" begin="12" end="12" resetval="0x1" description="VMON Error Mask to ESM" range="12" rwaccess="RW"/> 
		<bitfield id="ADC0_REF_OV_MASK" width="1" begin="11" end="11" resetval="0x1" description="VMON Error Mask to ESM" range="11" rwaccess="RW"/> 
		<bitfield id="CMP8_UV_ERR_MASK" width="1" begin="10" end="10" resetval="0x1" description="VMON Error Mask to ESM" range="10" rwaccess="RW"/> 
		<bitfield id="CMP7_UV_ERR_MASK" width="1" begin="9" end="9" resetval="0x1" description="VMON Error Mask to ESM" range="9" rwaccess="RW"/> 
		<bitfield id="CMP5_UV_ERR_MASK" width="1" begin="8" end="8" resetval="0x1" description="VMON Error Mask to ESM" range="8" rwaccess="RW"/> 
		<bitfield id="CMP5_OV_ERR_MASK" width="1" begin="7" end="7" resetval="0x1" description="VMON Error Mask to ESM" range="7" rwaccess="RW"/> 
		<bitfield id="CMP3_UV_ERR_MASK" width="1" begin="6" end="6" resetval="0x1" description="VMON Error Mask to ESM" range="6" rwaccess="RW"/> 
		<bitfield id="CMP3_OV_ERR_MASK" width="1" begin="5" end="5" resetval="0x1" description="VMON Error Mask to ESM" range="5" rwaccess="RW"/> 
		<bitfield id="CMP2_UV_ERR_MASK" width="1" begin="4" end="4" resetval="0x1" description="VMON Error Mask to ESM" range="4" rwaccess="RW"/> 
		<bitfield id="CMP2_OV_ERR_MASK" width="1" begin="3" end="3" resetval="0x1" description="VMON Error Mask to ESM" range="3" rwaccess="RW"/> 
		<bitfield id="CMP1_UV_ERR_NASK" width="1" begin="2" end="2" resetval="0x1" description="VMON Error Mask to ESM" range="2" rwaccess="RW"/> 
		<bitfield id="CMP1_OV_ERR_MASK" width="1" begin="1" end="1" resetval="0x1" description="VMON Error Mask to ESM" range="1" rwaccess="RW"/> 
		<bitfield id="CMP0_UV_ERR_MASK" width="1" begin="0" end="0" resetval="0x1" description="VMON Error Mask to ESM" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_MASK_VMON_ERROR_ESM_L" acronym="TOP_CTRL_MASK_VMON_ERROR_ESM_L" offset="0xC24" width="16" description="">
		<bitfield id="ADC34_REF_UV_MASK" width="1" begin="16" end="16" resetval="0x1" description="VMON Error Mask to INTR" range="16" rwaccess="RW"/> 
		<bitfield id="ADC34_REF_OV_MASK" width="1" begin="15" end="15" resetval="0x1" description="VMON Error Mask to INTR" range="15" rwaccess="RW"/> 
		<bitfield id="ADC12_REF_UV_MASK" width="1" begin="14" end="14" resetval="0x1" description="VMON Error Mask to INTR" range="14" rwaccess="RW"/> 
		<bitfield id="ADC12_REF_OV_MASK" width="1" begin="13" end="13" resetval="0x1" description="VMON Error Mask to INTR" range="13" rwaccess="RW"/> 
		<bitfield id="ADC0_REF_UV_MASK" width="1" begin="12" end="12" resetval="0x1" description="VMON Error Mask to INTR" range="12" rwaccess="RW"/> 
		<bitfield id="ADC0_REF_OV_MASK" width="1" begin="11" end="11" resetval="0x1" description="VMON Error Mask to INTR" range="11" rwaccess="RW"/> 
		<bitfield id="CMP8_UV_ERR_MASK" width="1" begin="10" end="10" resetval="0x1" description="VMON Error Mask to INTR" range="10" rwaccess="RW"/> 
		<bitfield id="CMP7_UV_ERR_MASK" width="1" begin="9" end="9" resetval="0x1" description="VMON Error Mask to INTR" range="9" rwaccess="RW"/> 
		<bitfield id="CMP5_UV_ERR_MASK" width="1" begin="8" end="8" resetval="0x1" description="VMON Error Mask to INTR" range="8" rwaccess="RW"/> 
		<bitfield id="CMP5_OV_ERR_MASK" width="1" begin="7" end="7" resetval="0x1" description="VMON Error Mask to INTR" range="7" rwaccess="RW"/> 
		<bitfield id="CMP3_UV_ERR_MASK" width="1" begin="6" end="6" resetval="0x1" description="VMON Error Mask to INTR" range="6" rwaccess="RW"/> 
		<bitfield id="CMP3_OV_ERR_MASK" width="1" begin="5" end="5" resetval="0x1" description="VMON Error Mask to INTR" range="5" rwaccess="RW"/> 
		<bitfield id="CMP2_UV_ERR_MASK" width="1" begin="4" end="4" resetval="0x1" description="VMON Error Mask to INTR" range="4" rwaccess="RW"/> 
		<bitfield id="CMP2_OV_ERR_MASK" width="1" begin="3" end="3" resetval="0x1" description="VMON Error Mask to INTR" range="3" rwaccess="RW"/> 
		<bitfield id="CMP1_UV_ERR_NASK" width="1" begin="2" end="2" resetval="0x1" description="VMON Error Mask to INTR" range="2" rwaccess="RW"/> 
		<bitfield id="CMP1_OV_ERR_MASK" width="1" begin="1" end="1" resetval="0x1" description="VMON Error Mask to INTR" range="1" rwaccess="RW"/> 
		<bitfield id="CMP0_UV_ERR_MASK" width="1" begin="0" end="0" resetval="0x1" description="VMON Error Mask to INTR" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_MASK_ANA_ISO" acronym="TOP_CTRL_MASK_ANA_ISO" offset="0xC30" width="8" description="">
		<bitfield id="MASK" width="3" begin="2" end="0" resetval="0x0" description="Mask the Ana ISO generating SOC reset due to a glitch on VDD OK.Used during Trim updates to the analog or during ADC Refbuf enable" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_VMON_FILTER_CTRL" acronym="TOP_CTRL_VMON_FILTER_CTRL" offset="0xC34" width="8" description="">
		<bitfield id="SELECT_VALUE" width="2" begin="1" end="0" resetval="0x0" description="VMON FILTER control select00 : no filtering (default)01 : filtering for 4.8us10 : filtering for 9.6us11 : filtering for 14.4us" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE_CFG" acronym="TOP_CTRL_TSENSE_CFG" offset="0xD00" width="32" description="">
		<bitfield id="TMPSOFF" width="1" begin="28" end="28" resetval="0x1" description="Temperature sensor off0 : on1 : off" range="28" rwaccess="RW"/> 
		<bitfield id="BGROFF" width="1" begin="24" end="24" resetval="0x1" description="BandGap on/off control 1 : off 0 : on" range="24" rwaccess="RW"/> 
		<bitfield id="AIPOFF" width="1" begin="20" end="20" resetval="0x1" description="1 : iddq mode select 0 : normal mode" range="20" rwaccess="RW"/> 
		<bitfield id="SNSR_MX_HIZ" width="1" begin="16" end="16" resetval="0x1" description="sensor mux hiz control0 : normal operation. Mux will select either one of the anlaog sensor  1 : mux  will be high impedence" range="16" rwaccess="RW"/> 
		<bitfield id="DELAY" width="6" begin="13" end="8" resetval="0x0" description="number of wait clock cycles between each TMPS Readout. Configure a Non zero value as delay value since configuring 0 is not allowed" range="13 - 8" rwaccess="RW"/> 
		<bitfield id="SENSOR_SEL" width="4" begin="7" end="4" resetval="0x0" description="Sensor Selection sensor enable bits for each sensor 0 : sensor disable 1 : sensor enablebit 3: temp_sensor3bit 2: temp_sensor2bit 1: temp_sensor1bit 0: temp_sensor0" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Temperature controller enable" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE_STATUS" acronym="TOP_CTRL_TSENSE_STATUS" offset="0xD04" width="8" description="">
		<bitfield id="S1_COLD" width="1" begin="6" end="6" resetval="0x0" description="temperature Sensor 1 cold event detect0 : event not occured1 : event occurred" range="6" rwaccess="RO"/> 
		<bitfield id="S1_HOT" width="1" begin="5" end="5" resetval="0x0" description="temperature Sensor 1 hot event detect0 : event not occured1 : event occurred" range="5" rwaccess="RO"/> 
		<bitfield id="S1_LOW_THRHLD" width="1" begin="4" end="4" resetval="0x0" description="temperature Sensor 1 low threshold event detect0 : event not occured1 : event occurred" range="4" rwaccess="RO"/> 
		<bitfield id="S0_COLD" width="1" begin="2" end="2" resetval="0x0" description="temperature Sensor 0 cold event detect0 : event not occured1 : event occurred" range="2" rwaccess="RO"/> 
		<bitfield id="S0_HOT" width="1" begin="1" end="1" resetval="0x0" description="temperature Sensor 0 hot event detect0 : event not occured1 : event occurred" range="1" rwaccess="RO"/> 
		<bitfield id="S0_LOW_THRHLD" width="1" begin="0" end="0" resetval="0x0" description="temperature Sensor 0 low threshold event detect0 : event not occured1 : event occurred" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE_STATUS_RAW" acronym="TOP_CTRL_TSENSE_STATUS_RAW" offset="0xD08" width="8" description="">
		<bitfield id="S1_COLD" width="1" begin="6" end="6" resetval="0x0" description="temperature Sensor 1 cold event detect0 : event not occured1 : event occurred" range="6" rwaccess="RO"/> 
		<bitfield id="S1_HOT" width="1" begin="5" end="5" resetval="0x0" description="temperature Sensor 1 hot event detect0 : event not occured1 : event occurred" range="5" rwaccess="RO"/> 
		<bitfield id="S1_LOW_THRHLD" width="1" begin="4" end="4" resetval="0x0" description="temperature Sensor 1 low threshold event detect0 : event not occured1 : event occurred" range="4" rwaccess="RO"/> 
		<bitfield id="S0_COLD" width="1" begin="2" end="2" resetval="0x0" description="temperature Sensor 0 cold event detect0 : event not occured1 : event occurred" range="2" rwaccess="RO"/> 
		<bitfield id="S0_HOT" width="1" begin="1" end="1" resetval="0x0" description="temperature Sensor 0 hot event detect0 : event not occured1 : event occurred" range="1" rwaccess="RO"/> 
		<bitfield id="S0_LOW_THRHLD" width="1" begin="0" end="0" resetval="0x0" description="temperature Sensor 0 low threshold event detect0 : event not occured1 : event occurred" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_TSHUT" acronym="TOP_CTRL_TSENSE0_TSHUT" offset="0xD10" width="32" description="">
		<bitfield id="EFUSE_OVERRIDE" width="3" begin="31" end="29" resetval="0x0" description="Efuse override000 -- Value from EFUSE is used as tshut hot and tshut cold thresholds111 - Overide value takes effect" range="31 - 29" rwaccess="RW"/> 
		<bitfield id="TSHUT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="tshut hot threshold. Reads efuse value untill overwritten with override = 111" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="TSHUT_THRSHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="tshut cold threshold. Reads efuse value untill overwritten with override = 111" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_ALERT" acronym="TOP_CTRL_TSENSE0_ALERT" offset="0xD14" width="24" description="">
		<bitfield id="ALERT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="hot threshold/high temp threshold" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="ALERT_THRHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="cold threshold/low temp threshold" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_CNTL" acronym="TOP_CTRL_TSENSE0_CNTL" offset="0xD18" width="24" description="">
		<bitfield id="MASK_LOW_THRHLD" width="1" begin="24" end="24" resetval="0x0" description="mask low threshold comparator output" range="24" rwaccess="RW"/> 
		<bitfield id="MASK_COLD" width="1" begin="20" end="20" resetval="0x1" description="mask cold comparator output" range="20" rwaccess="RW"/> 
		<bitfield id="MASK_HOT" width="1" begin="16" end="16" resetval="0x0" description="Mask hot comparator output" range="16" rwaccess="RW"/> 
		<bitfield id="ACCU_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="accumulator clear" range="8" rwaccess="RW"/> 
		<bitfield id="FIFO_FREEZE" width="1" begin="4" end="4" resetval="0x0" description="fifo freeze" range="4" rwaccess="RW"/> 
		<bitfield id="FIFO_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="fifo clear" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_RESULT" acronym="TOP_CTRL_TSENSE0_RESULT" offset="0xD1C" width="16" description="">
		<bitfield id="ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed" range="16" rwaccess="RO"/> 
		<bitfield id="DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout" range="7 - 0" rwaccess="RO"/>
	</register>
