IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_TSENSE0_DATA0" acronym="TOP_CTRL_TSENSE0_DATA0" offset="0xD20" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 0" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 0" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_DATA1" acronym="TOP_CTRL_TSENSE0_DATA1" offset="0xD24" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 1" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 1" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_DATA2" acronym="TOP_CTRL_TSENSE0_DATA2" offset="0xD28" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 2" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 2" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_DATA3" acronym="TOP_CTRL_TSENSE0_DATA3" offset="0xD2C" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 3" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 3" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE0_ACCU" acronym="TOP_CTRL_TSENSE0_ACCU" offset="0xD30" width="32" description="">
		<bitfield id="CUMUL" width="32" begin="31" end="0" resetval="0x0" description="cumulative sum of past DTEMPs" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_TSHUT" acronym="TOP_CTRL_TSENSE1_TSHUT" offset="0xD40" width="32" description="">
		<bitfield id="EFUSE_OVERRIDE" width="3" begin="31" end="29" resetval="0x0" description="Efuse override000 -- Value from EFUSE is used as tshut hot and tshut cold thresholds111 - Overide value takes effect" range="31 - 29" rwaccess="RW"/> 
		<bitfield id="TSHUT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="tshut hot threshold. Reads efuse value untill overwritten with override = 111" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="TSHUT_THRSHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="tshut cold threshold. Reads efuse value untill overwritten with override = 111" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_ALERT" acronym="TOP_CTRL_TSENSE1_ALERT" offset="0xD44" width="24" description="">
		<bitfield id="ALERT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="hot threshold/high temp threshold" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="ALERT_THRHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="cold threshold/low temp threshold" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_CNTL" acronym="TOP_CTRL_TSENSE1_CNTL" offset="0xD48" width="24" description="">
		<bitfield id="MASK_LOW_THRHLD" width="1" begin="24" end="24" resetval="0x0" description="mask low threshold comparator output" range="24" rwaccess="RW"/> 
		<bitfield id="MASK_COLD" width="1" begin="20" end="20" resetval="0x1" description="mask cold comparator output" range="20" rwaccess="RW"/> 
		<bitfield id="MASK_HOT" width="1" begin="16" end="16" resetval="0x0" description="Mask hot comparator output" range="16" rwaccess="RW"/> 
		<bitfield id="ACCU_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="accumulator clear" range="8" rwaccess="RW"/> 
		<bitfield id="FIFO_FREEZE" width="1" begin="4" end="4" resetval="0x0" description="fifo freeze" range="4" rwaccess="RW"/> 
		<bitfield id="FIFO_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="fifo clear" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_RESULT" acronym="TOP_CTRL_TSENSE1_RESULT" offset="0xD4C" width="16" description="">
		<bitfield id="ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed" range="16" rwaccess="RO"/> 
		<bitfield id="DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_DATA0" acronym="TOP_CTRL_TSENSE1_DATA0" offset="0xD50" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 0" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 0" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_DATA1" acronym="TOP_CTRL_TSENSE1_DATA1" offset="0xD54" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 1" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 1" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_DATA2" acronym="TOP_CTRL_TSENSE1_DATA2" offset="0xD58" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 2" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 2" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_DATA3" acronym="TOP_CTRL_TSENSE1_DATA3" offset="0xD5C" width="32" description="">
		<bitfield id="TAG" width="24" begin="31" end="8" resetval="0x0" description="tag 3" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="fifo data 3" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE1_ACCU" acronym="TOP_CTRL_TSENSE1_ACCU" offset="0xD60" width="32" description="">
		<bitfield id="CUMUL" width="32" begin="31" end="0" resetval="0x0" description="cumulative sum of past DTEMPs" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE2_RESULT" acronym="TOP_CTRL_TSENSE2_RESULT" offset="0xD7C" width="16" description="">
		<bitfield id="ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed" range="16" rwaccess="RO"/> 
		<bitfield id="DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_TSENSE3_RESULT" acronym="TOP_CTRL_TSENSE3_RESULT" offset="0xDAC" width="16" description="">
		<bitfield id="ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed" range="16" rwaccess="RO"/> 
		<bitfield id="DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_CTRL_DFT_ATB_GLOBALEN_ADC_CSS" acronym="TOP_CTRL_DFT_ATB_GLOBALEN_ADC_CSS" offset="0xE00" width="8" description="">
		<bitfield id="ATB_GLOBALEN_ADC4_CSS" width="1" begin="4" end="4" resetval="0x0" description="ADC does not use 3V ATB This signal is used to enable master 3V &#38; 1.8V switch (gates all cmpss 3V ATB access and cmpss+adc 1.8V atb access)" range="4" rwaccess="RW"/> 
		<bitfield id="ATB_GLOBALEN_ADC3_CSS" width="1" begin="3" end="3" resetval="0x0" description="ADC does not use 3V ATB This signal is used to enable master 3V &#38; 1.8V switch (gates all cmpss 3V ATB access and cmpss+adc 1.8V atb access)" range="3" rwaccess="RW"/> 
		<bitfield id="ATB_GLOBALEN_ADC2_CSS" width="1" begin="2" end="2" resetval="0x0" description="ADC does not use 3V ATB This signal is used to enable master 3V &#38; 1.8V switch (gates all cmpss 3V ATB access and cmpss+adc 1.8V atb access)" range="2" rwaccess="RW"/> 
		<bitfield id="ATB_GLOBALEN_ADC1_CSS" width="1" begin="1" end="1" resetval="0x0" description="ADC does not use 3V ATB This signal is used to enable master 3V &#38; 1.8V switch (gates all cmpss 3V ATB access and cmpss+adc 1.8V atb access)" range="1" rwaccess="RW"/> 
		<bitfield id="ATB_GLOBALEN_ADC0_CSS" width="1" begin="0" end="0" resetval="0x0" description="ADC does not use 3V ATB This signal is used to enable master 3V &#38; 1.8V switch (gates all cmpss 3V ATB access and cmpss+adc 1.8V atb access)" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_ATB0_MASTEREN_ADC_CSS_DAC" acronym="TOP_CTRL_DFT_ATB0_MASTEREN_ADC_CSS_DAC" offset="0xE04" width="32" description="">
		<bitfield id="DAC_ATB0_MASTEREN" width="1" begin="25" end="25" resetval="0x0" description="Master Enable : atb0 of dac12" range="25" rwaccess="RW"/> 
		<bitfield id="CSS4B1_ATB0_MASTEREN" width="1" begin="24" end="24" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="24" rwaccess="RW"/> 
		<bitfield id="CSS3B1_ATB0_MASTEREN" width="1" begin="23" end="23" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="23" rwaccess="RW"/> 
		<bitfield id="CSS2B1_ATB0_MASTEREN" width="1" begin="22" end="22" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="22" rwaccess="RW"/> 
		<bitfield id="CSS1B1_ATB0_MASTEREN" width="1" begin="21" end="21" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="21" rwaccess="RW"/> 
		<bitfield id="CSS0B1_ATB0_MASTEREN" width="1" begin="20" end="20" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="20" rwaccess="RW"/> 
		<bitfield id="CSS4B0_ATB0_MASTEREN" width="1" begin="19" end="19" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="19" rwaccess="RW"/> 
		<bitfield id="CSS3B0_ATB0_MASTEREN" width="1" begin="18" end="18" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="18" rwaccess="RW"/> 
		<bitfield id="CSS2B0_ATB0_MASTEREN" width="1" begin="17" end="17" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="17" rwaccess="RW"/> 
		<bitfield id="CSS1B0_ATB0_MASTEREN" width="1" begin="16" end="16" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="16" rwaccess="RW"/> 
		<bitfield id="CSS0B0_ATB0_MASTEREN" width="1" begin="15" end="15" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="15" rwaccess="RW"/> 
		<bitfield id="CSS4A1_ATB0_MASTEREN" width="1" begin="14" end="14" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="14" rwaccess="RW"/> 
		<bitfield id="CSS3A1_ATB0_MASTEREN" width="1" begin="13" end="13" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="13" rwaccess="RW"/> 
		<bitfield id="CSS2A1_ATB0_MASTEREN" width="1" begin="12" end="12" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="12" rwaccess="RW"/> 
		<bitfield id="CSS1A1_ATB0_MASTEREN" width="1" begin="11" end="11" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="11" rwaccess="RW"/> 
		<bitfield id="CSS0A1_ATB0_MASTEREN" width="1" begin="10" end="10" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="10" rwaccess="RW"/> 
		<bitfield id="CSS4A0_ATB0_MASTEREN" width="1" begin="9" end="9" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="9" rwaccess="RW"/> 
		<bitfield id="CSS3A0_ATB0_MASTEREN" width="1" begin="8" end="8" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="8" rwaccess="RW"/> 
		<bitfield id="CSS2A0_ATB0_MASTEREN" width="1" begin="7" end="7" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="7" rwaccess="RW"/> 
		<bitfield id="CSS1A0_ATB0_MASTEREN" width="1" begin="6" end="6" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="6" rwaccess="RW"/> 
		<bitfield id="CSS0A0_ATB0_MASTEREN" width="1" begin="5" end="5" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="5" rwaccess="RW"/> 
		<bitfield id="ADC4_ATB0_MASTEREN" width="1" begin="4" end="4" resetval="0x0" description="Master Enable : atb0 of corresponding adc" range="4" rwaccess="RW"/> 
		<bitfield id="ADC3_ATB0_MASTEREN" width="1" begin="3" end="3" resetval="0x0" description="Master Enable : atb0 of corresponding adc" range="3" rwaccess="RW"/> 
		<bitfield id="ADC2_ATB0_MASTEREN" width="1" begin="2" end="2" resetval="0x0" description="Master Enable : atb0 of corresponding adc" range="2" rwaccess="RW"/> 
		<bitfield id="ADC1_ATB0_MASTEREN" width="1" begin="1" end="1" resetval="0x0" description="Master Enable : atb0 of corresponding adc" range="1" rwaccess="RW"/> 
		<bitfield id="ADC0_ATB0_MASTEREN" width="1" begin="0" end="0" resetval="0x0" description="Master Enable : atb0 of corresponding adc" range="0" rwaccess="RW"/>
	</register>
