IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_DFT_ATB1_MASTEREN_ADC_CSS_DAC" acronym="TOP_CTRL_DFT_ATB1_MASTEREN_ADC_CSS_DAC" offset="0xE08" width="32" description="">
		<bitfield id="DAC_ATB1_MASTEREN" width="1" begin="25" end="25" resetval="0x0" description="Master Enable : atb0 of dac12" range="25" rwaccess="RW"/> 
		<bitfield id="CSS4B1_ATB1_MASTEREN" width="1" begin="24" end="24" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="24" rwaccess="RW"/> 
		<bitfield id="CSS3B1_ATB1_MASTEREN" width="1" begin="23" end="23" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="23" rwaccess="RW"/> 
		<bitfield id="CSS2B1_ATB1_MASTEREN" width="1" begin="22" end="22" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="22" rwaccess="RW"/> 
		<bitfield id="CSS1B1_ATB1_MASTEREN" width="1" begin="21" end="21" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="21" rwaccess="RW"/> 
		<bitfield id="CSS0B1_ATB1_MASTEREN" width="1" begin="20" end="20" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b1" range="20" rwaccess="RW"/> 
		<bitfield id="CSS4B0_ATB1_MASTEREN" width="1" begin="19" end="19" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="19" rwaccess="RW"/> 
		<bitfield id="CSS3B0_ATB1_MASTEREN" width="1" begin="18" end="18" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="18" rwaccess="RW"/> 
		<bitfield id="CSS2B0_ATB1_MASTEREN" width="1" begin="17" end="17" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="17" rwaccess="RW"/> 
		<bitfield id="CSS1B0_ATB1_MASTEREN" width="1" begin="16" end="16" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="16" rwaccess="RW"/> 
		<bitfield id="CSS0B0_ATB1_MASTEREN" width="1" begin="15" end="15" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-b0" range="15" rwaccess="RW"/> 
		<bitfield id="CSS4A1_ATB1_MASTEREN" width="1" begin="14" end="14" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="14" rwaccess="RW"/> 
		<bitfield id="CSS3A1_ATB1_MASTEREN" width="1" begin="13" end="13" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="13" rwaccess="RW"/> 
		<bitfield id="CSS2A1_ATB1_MASTEREN" width="1" begin="12" end="12" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="12" rwaccess="RW"/> 
		<bitfield id="CSS1A1_ATB1_MASTEREN" width="1" begin="11" end="11" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="11" rwaccess="RW"/> 
		<bitfield id="CSS0A1_ATB1_MASTEREN" width="1" begin="10" end="10" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a1" range="10" rwaccess="RW"/> 
		<bitfield id="CSS4A0_ATB1_MASTEREN" width="1" begin="9" end="9" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="9" rwaccess="RW"/> 
		<bitfield id="CSS3A0_ATB1_MASTEREN" width="1" begin="8" end="8" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="8" rwaccess="RW"/> 
		<bitfield id="CSS2A0_ATB1_MASTEREN" width="1" begin="7" end="7" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="7" rwaccess="RW"/> 
		<bitfield id="CSS1A0_ATB1_MASTEREN" width="1" begin="6" end="6" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="6" rwaccess="RW"/> 
		<bitfield id="CSS0A0_ATB1_MASTEREN" width="1" begin="5" end="5" resetval="0x0" description="Master Enable : atb0 of corresponding subsystems cmpss-a0" range="5" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_PMU_REFSYS_SAFETY" acronym="TOP_CTRL_DFT_PMU_REFSYS_SAFETY" offset="0xE0C" width="16" description="">
		<bitfield id="RCOSC_STOP" width="1" begin="15" end="15" resetval="0x0" description="0:rc enabled 1: stops rcosc clock" range="15" rwaccess="RW"/> 
		<bitfield id="BG_DIS" width="1" begin="14" end="14" resetval="0x0" description="Bandgap disable signal.1'b0 = Bandgap enabled. 1'b1 = Badgap disabled" range="14" rwaccess="RW"/> 
		<bitfield id="BG_FLIPEN_CTRL" width="1" begin="13" end="13" resetval="0x0" description="Bandgap flipen control for amplifier offset correction during trimming.1'b0 => normal operation; 1'b1 => AMP inputs flipped." range="13" rwaccess="RW"/> 
		<bitfield id="LDO_DIS" width="1" begin="12" end="12" resetval="0x0" description="Disables LDO if  set '1'" range="12" rwaccess="RW"/> 
		<bitfield id="ATB_MUX_SEL_SAFETYCOMP" width="3" begin="11" end="9" resetval="0x0" description="Selects analog signals for atestoutput for each of the test modes of the safety comparators according to test mode controlled by tb_ctrl_1p1v&#60;83:82> : Test Mode 1 (tb_ctrl_1p1v&#60;83:82>='b01): C5 &#38; C20: HIZ 1: vssa of C5; 2:vth_lo of C5; 3: vth_hi of C5; 4:vssa of C2;5:vth_lo of  C2; 6: vth_hi of  C2; 7:HIZTest Mode 2 (tb_ctrl_1p1v&#60;83:82>='b10): C3 &#38; C80: HIZ 1: vssa of C3; 2:vth_lo of C3; 3: vth_hi of C3; 4:vssa of C8;5:vth_lo of  C8; 6: vref of  C8 (1.2V*0.5); 7:HIZTest Mode 3 (tb_ctrl_1p1v&#60;83:82>='b11): C1 &#38; C00: HIZ 1: vssa of C1; 2:vth_lo of C1; 3: vth_hi of C1; 4:vssa of C0;5:vmon of  C0; 6: vref of  C0 ; 7:HIZSelects Analog Test Signals for Temperature Sensor if tb_ctrl_1p1v&#60;81> is enabled (refer to the spec for details)." range="11 - 9" rwaccess="RW"/> 
		<bitfield id="ATB_EN_SAFETYCOMP" width="2" begin="8" end="7" resetval="0x0" description="Enables three different test modes for safety comparators: 00: HIZ01: Test Mode1 enable10: Test Mode 2 enable11: Test Mode 3 enable" range="8 - 7" rwaccess="RW"/> 
		<bitfield id="ATB_EN_TS" width="1" begin="6" end="6" resetval="0x0" description="Analog test mode enable for temperature sesnsor" range="6" rwaccess="RW"/> 
		<bitfield id="ATB_EN_BG" width="1" begin="5" end="5" resetval="0x0" description="Bandgap atest enabled" range="5" rwaccess="RW"/> 
		<bitfield id="ATB_EN_LDO" width="1" begin="4" end="4" resetval="0x0" description="LDO atest enabled." range="4" rwaccess="RW"/> 
		<bitfield id="ATB_EN_SYSBOOT" width="1" begin="3" end="3" resetval="0x0" description="atest enable pins for PMU. Only one bit should be high at a time.system boot logic atest enabled." range="3" rwaccess="RW"/> 
		<bitfield id="ATB_MUX_SEL_PMU_REFSYS" width="3" begin="2" end="0" resetval="0x0" description="Common atest channel selection bits for bandgap, sysboot and LDO.Decoded to enable 8 channels of each module." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_ANA_DTB_ENABLES" acronym="TOP_CTRL_DFT_ANA_DTB_ENABLES" offset="0xE10" width="32" description="">
		<bitfield id="DAC_DTB_MASTEREN" width="1" begin="25" end="25" resetval="0x0" description="Master Enable : dtb0 of dac12" range="25" rwaccess="RW"/> 
		<bitfield id="CSS4B1_DTB_MASTEREN" width="1" begin="24" end="24" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b1" range="24" rwaccess="RW"/> 
		<bitfield id="CSS3B1_DTB_MASTEREN" width="1" begin="23" end="23" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b1" range="23" rwaccess="RW"/> 
		<bitfield id="CSS2B1_DTB_MASTEREN" width="1" begin="22" end="22" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b1" range="22" rwaccess="RW"/> 
		<bitfield id="CSS1B1_DTB_MASTEREN" width="1" begin="21" end="21" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b1" range="21" rwaccess="RW"/> 
		<bitfield id="CSS0B1_DTB_MASTEREN" width="1" begin="20" end="20" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b1" range="20" rwaccess="RW"/> 
		<bitfield id="CSS4B0_DTB_MASTEREN" width="1" begin="19" end="19" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b0" range="19" rwaccess="RW"/> 
		<bitfield id="CSS3B0_DTB_MASTEREN" width="1" begin="18" end="18" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b0" range="18" rwaccess="RW"/> 
		<bitfield id="CSS2B0_DTB_MASTEREN" width="1" begin="17" end="17" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b0" range="17" rwaccess="RW"/> 
		<bitfield id="CSS1B0_DTB_MASTEREN" width="1" begin="16" end="16" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b0" range="16" rwaccess="RW"/> 
		<bitfield id="CSS0B0_DTB_MASTEREN" width="1" begin="15" end="15" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-b0" range="15" rwaccess="RW"/> 
		<bitfield id="CSS4A1_DTB_MASTEREN" width="1" begin="14" end="14" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a1" range="14" rwaccess="RW"/> 
		<bitfield id="CSS3A1_DTB_MASTEREN" width="1" begin="13" end="13" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a1" range="13" rwaccess="RW"/> 
		<bitfield id="CSS2A1_DTB_MASTEREN" width="1" begin="12" end="12" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a1" range="12" rwaccess="RW"/> 
		<bitfield id="CSS1A1_DTB_MASTEREN" width="1" begin="11" end="11" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a1" range="11" rwaccess="RW"/> 
		<bitfield id="CSS0A1_DTB_MASTEREN" width="1" begin="10" end="10" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a1" range="10" rwaccess="RW"/> 
		<bitfield id="CSS4A0_DTB_MASTEREN" width="1" begin="9" end="9" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a0" range="9" rwaccess="RW"/> 
		<bitfield id="CSS3A0_DTB_MASTEREN" width="1" begin="8" end="8" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a0" range="8" rwaccess="RW"/> 
		<bitfield id="CSS2A0_DTB_MASTEREN" width="1" begin="7" end="7" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a0" range="7" rwaccess="RW"/> 
		<bitfield id="CSS1A0_DTB_MASTEREN" width="1" begin="6" end="6" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a0" range="6" rwaccess="RW"/> 
		<bitfield id="CSS0A0_DTB_MASTEREN" width="1" begin="5" end="5" resetval="0x0" description="Master Enable : dtb0 of corresponding subsystems cmpss-a0" range="5" rwaccess="RW"/> 
		<bitfield id="ADC4_DTB_MASTEREN" width="1" begin="4" end="4" resetval="0x0" description="Master Enable : dtb0 of corresponding adc" range="4" rwaccess="RW"/> 
		<bitfield id="ADC3_DTB_MASTEREN" width="1" begin="3" end="3" resetval="0x0" description="Master Enable : dtb0 of corresponding adc" range="3" rwaccess="RW"/> 
		<bitfield id="ADC2_DTB_MASTEREN" width="1" begin="2" end="2" resetval="0x0" description="Master Enable : dtb0 of corresponding adc" range="2" rwaccess="RW"/> 
		<bitfield id="ADC1_DTB_MASTEREN" width="1" begin="1" end="1" resetval="0x0" description="Master Enable : dtb0 of corresponding adc" range="1" rwaccess="RW"/> 
		<bitfield id="ADC0_DTB_MASTEREN" width="1" begin="0" end="0" resetval="0x0" description="Master Enable : dtb0 of corresponding adc" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_ADC_CHSEL_OV_CTRL_VALUE" acronym="TOP_CTRL_DFT_ADC_CHSEL_OV_CTRL_VALUE" offset="0xE14" width="16" description="">
		<bitfield id="ADC_CHSEL_OV_CTRL" width="1" begin="10" end="10" resetval="0x0" description="1 bit as the override control" range="10" rwaccess="RW"/> 
		<bitfield id="ADC_CHSEL" width="10" begin="9" end="0" resetval="0x0" description="ADC Channel select overrides adcX_ctrl_1p1v signal" range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_DAC_CTRL" acronym="TOP_CTRL_DFT_DAC_CTRL" offset="0xE18" width="8" description="">
		<bitfield id="DFT_LOAD_HIGH_EN" width="1" begin="8" end="8" resetval="0x0" description="Connects 5k resistor between Vout and vdd_3p3v" range="8" rwaccess="RW"/> 
		<bitfield id="DFT_LOAD_LOW_EN" width="1" begin="7" end="7" resetval="0x0" description="Connects 5k resistor between Vout and VSS" range="7" rwaccess="RW"/> 
		<bitfield id="IBIAS_20UA_ATB" width="1" begin="6" end="6" resetval="0x0" description="connects ibias_20uA current sink to test bus" range="6" rwaccess="RW"/> 
		<bitfield id="RDAC_VREF_HI_ATB" width="1" begin="5" end="5" resetval="0x0" description="Connects RDAC VREF_HI to test bus" range="5" rwaccess="RW"/> 
		<bitfield id="RDAC_VREF_LOW_ATB" width="1" begin="4" end="4" resetval="0x0" description="Connects RDAC VREF_LOW to test bus" range="4" rwaccess="RW"/> 
		<bitfield id="VSS_ATB" width="1" begin="3" end="3" resetval="0x0" description="Connects VSS to test bus" range="3" rwaccess="RW"/> 
		<bitfield id="VFEEDBACK_ATB" width="1" begin="2" end="2" resetval="0x0" description="Connects Vfeedback node to test bus" range="2" rwaccess="RW"/> 
		<bitfield id="RDAC_VBOT_ATB" width="1" begin="1" end="1" resetval="0x0" description="Connects RDAC VBOT node to test bus" range="1" rwaccess="RW"/> 
		<bitfield id="RDAC_VTOP_ATB" width="1" begin="0" end="0" resetval="0x0" description="Connects RDAC VTOP node to test bus" range="0" rwaccess="RW"/>
	</register>
