IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_DFT_CSS01_CTRL" acronym="TOP_CTRL_DFT_CSS01_CTRL" offset="0xE1C" width="32" description="">
		<bitfield id="CSS1_DTB_MUX_CONFIG" width="2" begin="25" end="24" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="CSS1_DTB_SELECT" width="1" begin="23" end="23" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="23" rwaccess="RW"/> 
		<bitfield id="CSS1_ATB_SELECT" width="2" begin="22" end="21" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="22 - 21" rwaccess="RW"/> 
		<bitfield id="CSS1_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="20" end="17" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="20 - 17" rwaccess="RW"/> 
		<bitfield id="CSS1_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="16" end="15" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="16 - 15" rwaccess="RW"/> 
		<bitfield id="CSS1_COMPOUT_BYPASS_VAL" width="1" begin="14" end="14" resetval="0x0" description="comparator bypass value" range="14" rwaccess="RW"/> 
		<bitfield id="CSS1_COMPOUT_BYPASS_EN" width="1" begin="13" end="13" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="13" rwaccess="RW"/> 
		<bitfield id="CSS0_DTB_MUX_CONFIG" width="2" begin="12" end="11" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CSS0_DTB_SELECT" width="1" begin="10" end="10" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="10" rwaccess="RW"/> 
		<bitfield id="CSS0_ATB_SELECT" width="2" begin="9" end="8" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="CSS0_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="7" end="4" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="CSS0_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="3" end="2" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="CSS0_COMPOUT_BYPASS_VAL" width="1" begin="1" end="1" resetval="0x0" description="comparator bypass value" range="1" rwaccess="RW"/> 
		<bitfield id="CSS0_COMPOUT_BYPASS_EN" width="1" begin="0" end="0" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_CSS23_CTRL" acronym="TOP_CTRL_DFT_CSS23_CTRL" offset="0xE20" width="32" description="">
		<bitfield id="CSS3_DTB_MUX_CONFIG" width="2" begin="25" end="24" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="CSS3_DTB_SELECT" width="1" begin="23" end="23" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="23" rwaccess="RW"/> 
		<bitfield id="CSS3_ATB_SELECT" width="2" begin="22" end="21" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="22 - 21" rwaccess="RW"/> 
		<bitfield id="CSS3_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="20" end="17" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="20 - 17" rwaccess="RW"/> 
		<bitfield id="CSS3_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="16" end="15" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="16 - 15" rwaccess="RW"/> 
		<bitfield id="CSS3_COMPOUT_BYPASS_VAL" width="1" begin="14" end="14" resetval="0x0" description="comparator bypass value" range="14" rwaccess="RW"/> 
		<bitfield id="CSS3_COMPOUT_BYPASS_EN" width="1" begin="13" end="13" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="13" rwaccess="RW"/> 
		<bitfield id="CSS2_DTB_MUX_CONFIG" width="2" begin="12" end="11" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CSS2_DTB_SELECT" width="1" begin="10" end="10" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="10" rwaccess="RW"/> 
		<bitfield id="CSS2_ATB_SELECT" width="2" begin="9" end="8" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="CSS2_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="7" end="4" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="CSS2_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="3" end="2" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="CSS2_COMPOUT_BYPASS_VAL" width="1" begin="1" end="1" resetval="0x0" description="comparator bypass value" range="1" rwaccess="RW"/> 
		<bitfield id="CSS2_COMPOUT_BYPASS_EN" width="1" begin="0" end="0" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_CSS45_CTRL" acronym="TOP_CTRL_DFT_CSS45_CTRL" offset="0xE24" width="32" description="">
		<bitfield id="CSS5_DTB_MUX_CONFIG" width="2" begin="25" end="24" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="CSS5_DTB_SELECT" width="1" begin="23" end="23" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="23" rwaccess="RW"/> 
		<bitfield id="CSS5_ATB_SELECT" width="2" begin="22" end="21" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="22 - 21" rwaccess="RW"/> 
		<bitfield id="CSS5_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="20" end="17" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="20 - 17" rwaccess="RW"/> 
		<bitfield id="CSS5_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="16" end="15" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="16 - 15" rwaccess="RW"/> 
		<bitfield id="CSS5_COMPOUT_BYPASS_VAL" width="1" begin="14" end="14" resetval="0x0" description="comparator bypass value" range="14" rwaccess="RW"/> 
		<bitfield id="CSS5_COMPOUT_BYPASS_EN" width="1" begin="13" end="13" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="13" rwaccess="RW"/> 
		<bitfield id="CSS4_DTB_MUX_CONFIG" width="2" begin="12" end="11" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CSS4_DTB_SELECT" width="1" begin="10" end="10" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="10" rwaccess="RW"/> 
		<bitfield id="CSS4_ATB_SELECT" width="2" begin="9" end="8" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="CSS4_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="7" end="4" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="CSS4_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="3" end="2" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="CSS4_COMPOUT_BYPASS_VAL" width="1" begin="1" end="1" resetval="0x0" description="comparator bypass value" range="1" rwaccess="RW"/> 
		<bitfield id="CSS4_COMPOUT_BYPASS_EN" width="1" begin="0" end="0" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="0" rwaccess="RW"/>
	</register>
