IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_CTRL_TOP_CTRL.xml
	<register id="TOP_CTRL_DFT_CSS67_CTRL" acronym="TOP_CTRL_DFT_CSS67_CTRL" offset="0xE28" width="32" description="">
		<bitfield id="CSS7_DTB_MUX_CONFIG" width="2" begin="25" end="24" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="CSS7_DTB_SELECT" width="1" begin="23" end="23" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="23" rwaccess="RW"/> 
		<bitfield id="CSS7_ATB_SELECT" width="2" begin="22" end="21" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="22 - 21" rwaccess="RW"/> 
		<bitfield id="CSS7_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="20" end="17" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="20 - 17" rwaccess="RW"/> 
		<bitfield id="CSS7_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="16" end="15" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="16 - 15" rwaccess="RW"/> 
		<bitfield id="CSS7_COMPOUT_BYPASS_VAL" width="1" begin="14" end="14" resetval="0x0" description="comparator bypass value" range="14" rwaccess="RW"/> 
		<bitfield id="CSS7_COMPOUT_BYPASS_EN" width="1" begin="13" end="13" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="13" rwaccess="RW"/> 
		<bitfield id="CSS6_DTB_MUX_CONFIG" width="2" begin="12" end="11" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CSS6_DTB_SELECT" width="1" begin="10" end="10" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="10" rwaccess="RW"/> 
		<bitfield id="CSS6_ATB_SELECT" width="2" begin="9" end="8" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="CSS6_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="7" end="4" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="CSS6_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="3" end="2" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="CSS6_COMPOUT_BYPASS_VAL" width="1" begin="1" end="1" resetval="0x0" description="comparator bypass value" range="1" rwaccess="RW"/> 
		<bitfield id="CSS6_COMPOUT_BYPASS_EN" width="1" begin="0" end="0" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_CSS89_CTRL" acronym="TOP_CTRL_DFT_CSS89_CTRL" offset="0xE2C" width="32" description="">
		<bitfield id="CSS9_DTB_MUX_CONFIG" width="2" begin="25" end="24" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="CSS9_DTB_SELECT" width="1" begin="23" end="23" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="23" rwaccess="RW"/> 
		<bitfield id="CSS9_ATB_SELECT" width="2" begin="22" end="21" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="22 - 21" rwaccess="RW"/> 
		<bitfield id="CSS9_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="20" end="17" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="20 - 17" rwaccess="RW"/> 
		<bitfield id="CSS9_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="16" end="15" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="16 - 15" rwaccess="RW"/> 
		<bitfield id="CSS9_COMPOUT_BYPASS_VAL" width="1" begin="14" end="14" resetval="0x0" description="comparator bypass value" range="14" rwaccess="RW"/> 
		<bitfield id="CSS9_COMPOUT_BYPASS_EN" width="1" begin="13" end="13" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="13" rwaccess="RW"/> 
		<bitfield id="CSS8_DTB_MUX_CONFIG" width="2" begin="12" end="11" resetval="0x0" description="2   b00 = MSB  (default)2   b01 = LSB2   b10 = Enable2   b11 = compout" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CSS8_DTB_SELECT" width="1" begin="10" end="10" resetval="0x0" description="1   b0 = dtb connected for compL  (default)1   b1 = dtb connected for compH" range="10" rwaccess="RW"/> 
		<bitfield id="CSS8_ATB_SELECT" width="2" begin="9" end="8" resetval="0x0" description="2   b00 = atb off (default)2   b01 = atb enable for compL2   b10 = atb enable for compH2   b11 = both ATB active" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="CSS8_TESTANA_L_ANA_MUX_CONTROL" width="4" begin="7" end="4" resetval="0x0" description="4   b0000 = 1p8v testana isolated (default)4   b0001 = vref_int4   b0010 = vref_low4   b0011 = vdac&#60;0>4   b0100 = vdac&#60;1>4   b0101 = vss4   b0110 = ibias 10uA ( atleast 1.25v at the pad)4   b0111 = por_ibias 10uA (atleast 1.25v at the pad)4   b1000 = cmp out1_p4   b1001 = cmp_out1_n" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="CSS8_TESTANA_L_SUP_MUX_CONTROL" width="2" begin="3" end="2" resetval="0x0" description="For: compssa_L                       POS IN // NEG IN2   b00 = POS Mux control // DAC (default)2   b01 = ATB // DAC (tb_ctrl_1p1v&#60;1> = 1'b1)2   b10 = POS Mux control // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = POS Mux control // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)For: compssa_H                       POS IN // NEG IN2   b00 = inh // NEG Mux control (default)2   b01 = ATB (tb_ctrl_1p1v&#60;1> = 1'b1) // NEG Mux control2   b10 = inh // ATB (tb_ctrl_1p1v&#60;1> = 1'b1)2   b11 = inh // DAC - ATB shorted (tb_ctrl_1p1v&#60;1> = 1'b1)" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="CSS8_COMPOUT_BYPASS_VAL" width="1" begin="1" end="1" resetval="0x0" description="comparator bypass value" range="1" rwaccess="RW"/> 
		<bitfield id="CSS8_COMPOUT_BYPASS_EN" width="1" begin="0" end="0" resetval="0x0" description="1   b0 = compout is connected to internal comparator (default)1   b1 = compout is equal to compout_bypass_val" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_RAMP_DACL" acronym="TOP_CTRL_DFT_RAMP_DACL" offset="0xE30" width="24" description="">
		<bitfield id="RAMP_DACL" width="20" begin="19" end="0" resetval="0x0" description="Fanout internal ramp to DACL of the CMPSS (currently reserved)" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_REFBUF_CTRL" acronym="TOP_CTRL_DFT_REFBUF_CTRL" offset="0xE34" width="8" description="">
		<bitfield id="REFBUF1_ATB_MUX_SEL" width="2" begin="8" end="7" resetval="0x0" description="Analog test select controls for reference buffer and comparators" range="8 - 7" rwaccess="RW"/> 
		<bitfield id="REFBUF0_ATB_MUX_SEL" width="2" begin="6" end="5" resetval="0x0" description="Analog test select controls for reference buffer and comparators" range="6 - 5" rwaccess="RW"/> 
		<bitfield id="REFBUF1_ATBEN" width="1" begin="4" end="4" resetval="0x0" description="Atest enable REFBUF1" range="4" rwaccess="RW"/> 
		<bitfield id="REFBUF1_ATBEN_ROK1" width="1" begin="3" end="3" resetval="0x0" description="analog test  enable for the comparators ROK1" range="3" rwaccess="RW"/> 
		<bitfield id="REFBUF0_ATBEN" width="1" begin="2" end="2" resetval="0x0" description="Atest enable REFBUF0" range="2" rwaccess="RW"/> 
		<bitfield id="REFBUF0_ATBEN_ROK0" width="1" begin="1" end="1" resetval="0x0" description="analog test  enable for the comparators ROK0" range="1" rwaccess="RW"/> 
		<bitfield id="REFBUF0_ATBEN_ROK0B" width="1" begin="0" end="0" resetval="0x0" description="analog test  enable for the comparators ROK0B" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_ODP_ATB_LOOPBACK_CTRL" acronym="TOP_CTRL_DFT_ODP_ATB_LOOPBACK_CTRL" offset="0xE38" width="32" description="">
		<bitfield id="RESERVED" width="29" begin="31" end="3" resetval="0x0" description="Reserved bits" range="31 - 3" rwaccess="RW"/> 
		<bitfield id="ATB1_ADCCAL1_LB" width="1" begin="2" end="2" resetval="0x0" description="if '1' connects atestv1 to adc_cal1" range="2" rwaccess="RW"/> 
		<bitfield id="ATB0_ADCCAL0_LB" width="1" begin="1" end="1" resetval="0x0" description="if '1' connects atestv0 to adc_cal0 (must ensure adc_cal0 is not driven)" range="1" rwaccess="RW"/> 
		<bitfield id="ODP_EN" width="1" begin="0" end="0" resetval="0x0" description="must set '1' to test odp module" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_SOC_DTB_MUX_SEL" acronym="TOP_CTRL_DFT_SOC_DTB_MUX_SEL" offset="0xE3C" width="8" description="">
		<bitfield id="DTB_MUX_SEL" width="8" begin="7" end="0" resetval="0x0" description="Mux selection controls for selecting the DTB lines going out of SOC for debug purpose and for testing." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_CTRL_DFT_TEMPSENSE_CTRL" acronym="TOP_CTRL_DFT_TEMPSENSE_CTRL" offset="0xE40" width="0" description="">
		<bitfield id="SENSOR5_SEL" width="1" begin="0" end="0" resetval="0x0" description="Sensor control for 5th local sensor" range="0" rwaccess="RW"/>
	</register>
